Revit 2026 API

# CurveArrArray Properties

---

The CurveArrArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Item | Gets or sets an item at a specified index within the array. |
|  | Size | Returns the number of objects that are in the array. |

#### Reference

CurveArrArray Class

Autodesk.Revit.DB Namespace